[
    {
        "id": 1,
        "image": "https://i.ibb.co/XjhSYzk/wedding.jpg",
        "title": "Wedding Gift",
        "description": "Celebrate the union of two souls with our exquisite wedding gift. This carefully chosen token of love is designed to add a touch of elegance to the newlyweds' journey together. Crafted with precision and love, it symbolizes the promise of forever and the start of a beautiful adventure. Let this gift be a reminder of the joyous day they said",
        "occasion": "Wedding",
        "details": "Details",
        "price": 190.99
    },
    {
        "id": 2,
        "image": "https://i.ibb.co/hXSpnrk/birthday.jpg",
        "title": "Birthday Surprise",
        "description": "Make birthdays extra special with our delightful birthday surprise. It's not just a gift; it's a memory in the making. Whether it's a milestone celebration or simply another year of life's journey, this gift will add a sprinkle of happiness to the day. Choose it to bring a smile to their face and make their birthday unforgettable.",
        "occasion": "Birthday",
        "details": "Details",
        "price": 124.99
    },
    {
        "id": 3,
        "image": "https://i.ibb.co/YLJD4n1/anniversary.jpg",
        "title": "Anniversary Celebration",
        "description": "Celebrate the love and years together with our anniversary celebration gift. It's a tribute to the journey of togetherness, filled with laughter, love, and cherished moments. This gift is a reflection of the beautiful bond you share, and it's a perfect way to say 'Happy Anniversary' with style and grace.",
        "occasion": "Anniversary",
        "details": "Details",
        "price": 175.50
    },
    {
        "id": 4,
        "image": "https://i.ibb.co/wh0ZCZn/babyshower.jpg",
        "title": "Baby Shower Gift",
        "description": "A sweet gift for the mom-to-be! Our baby shower gift is designed to embrace the joy of impending motherhood. It's a thoughtful gesture to shower the expecting mom with love and support. Welcome the new arrival with a gift that represents the warmth and excitement of a growing family.",
        "occasion": "Baby Shower",
        "details": "Details",
        "price": 129.99
    },
    {
        "id": 5,
        "image": "https://i.ibb.co/VTrm3kb/engagement.jpg",
        "title": "Engagement Surprise",
        "description": "Congratulate the newly engaged couple with our engagement surprise gift. It's a token of your best wishes for their exciting journey towards marriage. This gift encapsulates the thrill of love and commitment, symbolizing the beginning of a beautiful chapter in their lives.",
        "occasion": "Engagement",
        "details": "Details",
        "price": 142.95
    },
    {
        "id": 6,
        "image": "https://i.ibb.co/02yT5vp/retirement.jpg",
        "title": "Retirement Farewell",
        "description": "Wishing them a happy retirement! Our retirement farewell gift is a tribute to years of hard work and dedication. It's a heartfelt way to say goodbye to the working world and hello to a well-deserved phase of relaxation and adventure. Send your best wishes for a retirement filled with joy and new experiences.",
        "occasion": "Retirement",
        "details": "Details",
        "price": 139.99
    }
]
